posts/2019/redis-fundamental.org
#+BEGIN_COMMENT
.. title: redis基础
.. slug: redis-fundamental
.. date: 2019-04-24 11:01:09 UTC+08:00
.. tags: redis, nosql, memcached
.. category: redis
.. link: https://www.tutorialspoint.com/redis/
.. description:
.. type: text
/.. status: draft
#+END_COMMENT
#+OPTIONS: num:t

#+TITLE: redis基础

本文是 [[https://www.tutorialspoint.com/redis/][tutorialspoint]] 提供的 [[https://redis.io/][redis]] 教程的学习笔记。

{{{TEASER_END}}}

** redis 数据类型
*** string 类型
redis的string是字节流（sequence of bytes），是二进制安全的，它有一个给定的长度，不会被任何字符终止符截断。单个string支持的最大长度为512MB。因此可以存放任意小于512MB的数据在单个string中。

操作示例
#+BEGIN_SRC sh
redis 127.0.0.1:6379> SET name "tutorialspoint"
OK
redis 127.0.0.1:6379> GET name
"tutorialspoint"
#+END_SRC

string 类型的更多操作命令详见 [[https://www.tutorialspoint.com/redis/redis_strings.htm][redis string]] 。

*** hash 类型
redis 的 hash 是一个键值对（key value pairs）集合。它们是从字段（string field）到值（string value）的映射。因此它可以用来表示一个对象（object）。

操作示例
#+BEGIN_SRC sh
redis 127.0.0.1:6379> HMSET user:1 username tutorialspoint password tutorialspoint points 200
OK
redis 127.0.0.1:6379> HGETALL user:1
1) "username"
2) "tutorialspoint"
3) "password"
4) "tutorialspoint"
5) "points"
6) "200"
#+END_SRC

hash 类型的更多操作命令详见 [[https://www.tutorialspoint.com/redis/redis_hashes.htm][redis hash]] 。

*** list 类型
redis 的 list 是一个 string 链表，按照插入顺序排列。支持从头部和尾部插入元素。

操作示例
#+BEGIN_SRC sh
redis 127.0.0.1:6379> lpush tutoriallist redis
(integer) 1
redis 127.0.0.1:6379> lpush tutoriallist mongodb
(integer) 2
redis 127.0.0.1:6379> lpush tutoriallist rabitmq
(integer) 3
redis 127.0.0.1:6379> lrange tutoriallist 0 10

1) "rabitmq"
2) "mongodb"
3) "redis"
#+END_SRC

list 类型的更多操作命令详见 [[https://www.tutorialspoint.com/redis/redis_lists.htm][redis list]] 。

*** set 类型
redis 的 set 是多个 string 的无序集合。其增加、删除、测试操作成员的时间复杂度是 O(1) 。set 中的元素不会重复。

操作示例
#+BEGIN_SRC sh
redis 127.0.0.1:6379> sadd tutoriallist redis
(integer) 1
redis 127.0.0.1:6379> sadd tutoriallist mongodb
(integer) 1
redis 127.0.0.1:6379> sadd tutoriallist rabitmq
(integer) 1
redis 127.0.0.1:6379> sadd tutoriallist rabitmq
(integer) 0
redis 127.0.0.1:6379> smembers tutoriallist

1) "rabitmq"
2) "mongodb"
3) "redis"
#+END_SRC

set 类型的更多操作命令详见 [[https://www.tutorialspoint.com/redis/redis_sets.htm][redis set]] 。

*** sorted set 类型
redis 的 sorted set 与其 set 类似，无重复元素的 string 集合。区别在于，每个 sorted set 中的成员都关联上一个分数（score），这个分数用于对成员进行排序。其中的每个成员都是唯一的，成员的分数可以重复。

操作示例
#+BEGIN_SRC sh
redis 127.0.0.1:6379> zadd tutoriallist 0 redis
(integer) 1
redis 127.0.0.1:6379> zadd tutoriallist 0 mongodb
(integer) 1
redis 127.0.0.1:6379> zadd tutoriallist 0 rabitmq
(integer) 1
redis 127.0.0.1:6379> zadd tutoriallist 0 rabitmq
(integer) 0
redis 127.0.0.1:6379> ZRANGEBYSCORE tutoriallist 0 1000

1) "redis"
2) "mongodb"
3) "rabitmq"
#+END_SRC

sorted set 类型的更多操作命令详见 [[https://www.tutorialspoint.com/redis/redis_sorted_sets.htm][redis sorted set]] 。

** redis 实用功能

*** HyperLogLog 集合计数
HyperLogLog 是一种用于实现粗略统计集合（set）中元素个数的算法。它的优点在于空间复杂度为O(1)，仅需要使用很少的定量的内存即可实现唯一性（unique）元素的统计。每个 key 的内存大约为 12kb，误差率为 0.81% 。

操作示例
#+BEGIN_SRC sh
redis 127.0.0.1:6379> PFADD tutorials "redis"
1) (integer) 1
redis 127.0.0.1:6379> PFADD tutorials "mongodb"
1) (integer) 1
redis 127.0.0.1:6379> PFADD tutorials "mysql"
1) (integer) 1
redis 127.0.0.1:6379> PFCOUNT tutorials
(integer) 3
#+END_SRC

HyperLogLog 的更多操作命令详见 [[https://www.tutorialspoint.com/redis/redis_hyperloglog.htm][redis HyperLogLog]] 。

