posts/2019/redis-fundamental/index.html
<!DOCTYPE html>
<html prefix="og: http://ogp.me/ns#" lang="en">
<head>
<meta charset="utf-8">
<meta http-equiv="content-type" content="text/html; charset=utf-8">
<meta http-equiv="x-ua-compatible" content="IE=edge">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>redis基础 | Hack Note</title>
<meta name="theme-color" content="#04519b">
<meta name="generator" content="Nikola (getnikola.com)">
<link rel="alternate" type="application/rss+xml" title="RSS" href="/rss.xml">
<link href="/assets/css/minima.min.css" rel="stylesheet" type="text/css">
<link rel="canonical" href="https://blog.wangzhl.com/posts/2019/redis-fundamental/">
<link rel="icon" href="/favicon.ico" sizes="64x64">
<link rel="prev" href="/posts/2019/inside-the-cpp-object-model-4/" title="深入探索C++内存模型（4）" type="text/html">
<link rel="next" href="/posts/2019/makefile_cheatsheet/" title="Makefile 要点备忘" type="text/html">
<meta name="author" content="Samson Wang">
<meta property="og:site_name" content="Hack Note">
<meta property="og:title" content="redis基础">
<meta property="og:url" content="https://blog.wangzhl.com/posts/2019/redis-fundamental/">
<meta property="og:description" content="本文是 tutorialspoint 提供的 redis 教程的学习笔记。





1 redis 数据类型



1.1 string 类型


redis的string是字节流（sequence of bytes），是二进制安全的，它有一个给定的长度，不会被任何字符终止符截断。单个string支持的最大长度为512MB。因此可以存放任意小于512MB的数据在单个string中。



操作示">
<meta property="og:type" content="article">
<meta property="article:published_time" content="2019-04-24T11:01:09+08:00">
<meta property="article:tag" content="memcached">
<meta property="article:tag" content="nosql">
<meta property="article:tag" content="redis">
</head>
<body>
  <header class="site-header nav-custom"><div class="wrapper">
      <a class="site-title" rel="author" href="/">Hack Note</a>
      <nav class="site-nav"><input type="checkbox" id="nav-trigger" class="nav-trigger"><label for="nav-trigger">
          <span class="menu-icon">
            <svg viewbox="0 0 18 15" width="18px" height="15px"><use href="/assets/svg/theme.svg#menu-icon"></use></svg></span>
        </label>
        <div class="trigger">
          
            <a class="page-link" href="/">Home</a>
            <a class="page-link" href="/archive/">Archive</a>
            <a class="page-link" href="/tags/">Tags</a>
            <a class="page-link" href="/about/">About</a>

        </div>
      </nav>
</div>
  </header><main class="page-content" aria-label="Content"><div class="wrapper">

    

    
<article class="post h-entry" itemscope="" itemtype="http://schema.org/BlogPosting"><header class="post-header"><h1 class="post-title p-name" itemprop="name headline">redis基础</h1>

    <p class="post-meta">
      
    <time class="dt-published" datetime="2019-04-24T11:01:09+08:00" itemprop="datePublished">Apr 24, 2019</time></p>
  </header><div class="post-content e-content" itemprop="articleBody text">
    <p>
本文是 <a href="https://www.tutorialspoint.com/redis/">tutorialspoint</a> 提供的 <a href="https://redis.io/">redis</a> 教程的学习笔记。<br></p>

<!-- TEASER_END -->

<div id="outline-container-orga14a41c" class="outline-2">
<h2 id="orga14a41c">
<span class="section-number-2">1</span> redis 数据类型</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-orgc5d60a0" class="outline-3">
<h3 id="orgc5d60a0">
<span class="section-number-3">1.1</span> string 类型</h3>
<div class="outline-text-3" id="text-1-1">
<p>
redis的string是字节流（sequence of bytes），是二进制安全的，它有一个给定的长度，不会被任何字符终止符截断。单个string支持的最大长度为512MB。因此可以存放任意小于512MB的数据在单个string中。<br></p>

<p>
操作示例<br></p>
<div class="highlight"><pre><span></span>redis <span class="m">127</span>.0.0.1:6379&gt; SET name <span class="s2">"tutorialspoint"</span>
OK
redis <span class="m">127</span>.0.0.1:6379&gt; GET name
<span class="s2">"tutorialspoint"</span>
</pre></div>

<p>
string 类型的更多操作命令详见 <a href="https://www.tutorialspoint.com/redis/redis_strings.htm">redis string</a> 。<br></p>
</div>
</div>

<div id="outline-container-org176a02c" class="outline-3">
<h3 id="org176a02c">
<span class="section-number-3">1.2</span> hash 类型</h3>
<div class="outline-text-3" id="text-1-2">
<p>
redis 的 hash 是一个键值对（key value pairs）集合。它们是从字段（string field）到值（string value）的映射。因此它可以用来表示一个对象（object）。<br></p>

<p>
操作示例<br></p>
<div class="highlight"><pre><span></span>redis <span class="m">127</span>.0.0.1:6379&gt; HMSET user:1 username tutorialspoint password tutorialspoint points <span class="m">200</span>
OK
redis <span class="m">127</span>.0.0.1:6379&gt; HGETALL user:1
<span class="m">1</span><span class="o">)</span> <span class="s2">"username"</span>
<span class="m">2</span><span class="o">)</span> <span class="s2">"tutorialspoint"</span>
<span class="m">3</span><span class="o">)</span> <span class="s2">"password"</span>
<span class="m">4</span><span class="o">)</span> <span class="s2">"tutorialspoint"</span>
<span class="m">5</span><span class="o">)</span> <span class="s2">"points"</span>
<span class="m">6</span><span class="o">)</span> <span class="s2">"200"</span>
</pre></div>

<p>
hash 类型的更多操作命令详见 <a href="https://www.tutorialspoint.com/redis/redis_hashes.htm">redis hash</a> 。<br></p>
</div>
</div>

<div id="outline-container-org0c88867" class="outline-3">
<h3 id="org0c88867">
<span class="section-number-3">1.3</span> list 类型</h3>
<div class="outline-text-3" id="text-1-3">
<p>
redis 的 list 是一个 string 链表，按照插入顺序排列。支持从头部和尾部插入元素。<br></p>

<p>
操作示例<br></p>
<div class="highlight"><pre><span></span>redis <span class="m">127</span>.0.0.1:6379&gt; lpush tutoriallist redis
<span class="o">(</span>integer<span class="o">)</span> <span class="m">1</span>
redis <span class="m">127</span>.0.0.1:6379&gt; lpush tutoriallist mongodb
<span class="o">(</span>integer<span class="o">)</span> <span class="m">2</span>
redis <span class="m">127</span>.0.0.1:6379&gt; lpush tutoriallist rabitmq
<span class="o">(</span>integer<span class="o">)</span> <span class="m">3</span>
redis <span class="m">127</span>.0.0.1:6379&gt; lrange tutoriallist <span class="m">0</span> <span class="m">10</span>

<span class="m">1</span><span class="o">)</span> <span class="s2">"rabitmq"</span>
<span class="m">2</span><span class="o">)</span> <span class="s2">"mongodb"</span>
<span class="m">3</span><span class="o">)</span> <span class="s2">"redis"</span>
</pre></div>

<p>
list 类型的更多操作命令详见 <a href="https://www.tutorialspoint.com/redis/redis_lists.htm">redis list</a> 。<br></p>
</div>
</div>

<div id="outline-container-org746cbb7" class="outline-3">
<h3 id="org746cbb7">
<span class="section-number-3">1.4</span> set 类型</h3>
<div class="outline-text-3" id="text-1-4">
<p>
redis 的 set 是多个 string 的无序集合。其增加、删除、测试操作成员的时间复杂度是 O(1) 。set 中的元素不会重复。<br></p>

<p>
操作示例<br></p>
<div class="highlight"><pre><span></span>redis <span class="m">127</span>.0.0.1:6379&gt; sadd tutoriallist redis
<span class="o">(</span>integer<span class="o">)</span> <span class="m">1</span>
redis <span class="m">127</span>.0.0.1:6379&gt; sadd tutoriallist mongodb
<span class="o">(</span>integer<span class="o">)</span> <span class="m">1</span>
redis <span class="m">127</span>.0.0.1:6379&gt; sadd tutoriallist rabitmq
<span class="o">(</span>integer<span class="o">)</span> <span class="m">1</span>
redis <span class="m">127</span>.0.0.1:6379&gt; sadd tutoriallist rabitmq
<span class="o">(</span>integer<span class="o">)</span> <span class="m">0</span>
redis <span class="m">127</span>.0.0.1:6379&gt; smembers tutoriallist

<span class="m">1</span><span class="o">)</span> <span class="s2">"rabitmq"</span>
<span class="m">2</span><span class="o">)</span> <span class="s2">"mongodb"</span>
<span class="m">3</span><span class="o">)</span> <span class="s2">"redis"</span>
</pre></div>

<p>
set 类型的更多操作命令详见 <a href="https://www.tutorialspoint.com/redis/redis_sets.htm">redis set</a> 。<br></p>
</div>
</div>

<div id="outline-container-orga3b6fa7" class="outline-3">
<h3 id="orga3b6fa7">
<span class="section-number-3">1.5</span> sorted set 类型</h3>
<div class="outline-text-3" id="text-1-5">
<p>
redis 的 sorted set 与其 set 类似，无重复元素的 string 集合。区别在于，每个 sorted set 中的成员都关联上一个分数（score），这个分数用于对成员进行排序。其中的每个成员都是唯一的，成员的分数可以重复。<br></p>

<p>
操作示例<br></p>
<div class="highlight"><pre><span></span>redis <span class="m">127</span>.0.0.1:6379&gt; zadd tutoriallist <span class="m">0</span> redis
<span class="o">(</span>integer<span class="o">)</span> <span class="m">1</span>
redis <span class="m">127</span>.0.0.1:6379&gt; zadd tutoriallist <span class="m">0</span> mongodb
<span class="o">(</span>integer<span class="o">)</span> <span class="m">1</span>
redis <span class="m">127</span>.0.0.1:6379&gt; zadd tutoriallist <span class="m">0</span> rabitmq
<span class="o">(</span>integer<span class="o">)</span> <span class="m">1</span>
redis <span class="m">127</span>.0.0.1:6379&gt; zadd tutoriallist <span class="m">0</span> rabitmq
<span class="o">(</span>integer<span class="o">)</span> <span class="m">0</span>
redis <span class="m">127</span>.0.0.1:6379&gt; ZRANGEBYSCORE tutoriallist <span class="m">0</span> <span class="m">1000</span>

<span class="m">1</span><span class="o">)</span> <span class="s2">"redis"</span>
<span class="m">2</span><span class="o">)</span> <span class="s2">"mongodb"</span>
<span class="m">3</span><span class="o">)</span> <span class="s2">"rabitmq"</span>
</pre></div>

<p>
sorted set 类型的更多操作命令详见 <a href="https://www.tutorialspoint.com/redis/redis_sorted_sets.htm">redis sorted set</a> 。<br></p>
</div>
</div>
</div>

<div id="outline-container-org1d376cc" class="outline-2">
<h2 id="org1d376cc">
<span class="section-number-2">2</span> redis 实用功能</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org73c8b0c" class="outline-3">
<h3 id="org73c8b0c">
<span class="section-number-3">2.1</span> HyperLogLog 集合计数</h3>
<div class="outline-text-3" id="text-2-1">
<p>
HyperLogLog 是一种用于实现粗略统计集合（set）中元素个数的算法。它的优点在于空间复杂度为O(1)，仅需要使用很少的定量的内存即可实现唯一性（unique）元素的统计。每个 key 的内存大约为 12kb，误差率为 0.81% 。<br></p>

<p>
操作示例<br></p>
<div class="highlight"><pre><span></span>redis <span class="m">127</span>.0.0.1:6379&gt; PFADD tutorials <span class="s2">"redis"</span>
<span class="m">1</span><span class="o">)</span> <span class="o">(</span>integer<span class="o">)</span> <span class="m">1</span>
redis <span class="m">127</span>.0.0.1:6379&gt; PFADD tutorials <span class="s2">"mongodb"</span>
<span class="m">1</span><span class="o">)</span> <span class="o">(</span>integer<span class="o">)</span> <span class="m">1</span>
redis <span class="m">127</span>.0.0.1:6379&gt; PFADD tutorials <span class="s2">"mysql"</span>
<span class="m">1</span><span class="o">)</span> <span class="o">(</span>integer<span class="o">)</span> <span class="m">1</span>
redis <span class="m">127</span>.0.0.1:6379&gt; PFCOUNT tutorials
<span class="o">(</span>integer<span class="o">)</span> <span class="m">3</span>
</pre></div>

<p>
HyperLogLog 的更多操作命令详见 <a href="https://www.tutorialspoint.com/redis/redis_hyperloglog.htm">redis HyperLogLog</a> 。<br></p>
</div>
</div>
