posts/2019/redis-fundamental/index.html

<div id="outline-container-org75f5b9a" class="outline-3">
<h3 id="org75f5b9a">
<span class="section-number-3">2.2</span> Publish Subscribe 消息队列</h3>
<div class="outline-text-3" id="text-2-2">
<p>
redis 的 Pub/Sub 是一种消息分发系统。由发送方（publisher）产生消息，由接收方（subscriber）接收消息，消息传递的通路叫做信道（channel）。<br></p>

<p>
消息接收操作示例<br></p>
<div class="highlight"><pre><span></span>redis <span class="m">127</span>.0.0.1:6379&gt; SUBSCRIBE redisChat
Reading messages... <span class="o">(</span>press Ctrl-C to quit<span class="o">)</span>
<span class="m">1</span><span class="o">)</span> <span class="s2">"subscribe"</span>
<span class="m">2</span><span class="o">)</span> <span class="s2">"redisChat"</span>
<span class="m">3</span><span class="o">)</span> <span class="o">(</span>integer<span class="o">)</span> <span class="m">1</span>
</pre></div>

<p>
消息发送操作示例<br></p>
<div class="highlight"><pre><span></span>redis <span class="m">127</span>.0.0.1:6379&gt; PUBLISH redisChat <span class="s2">"Redis is a great caching technique"</span>
<span class="o">(</span>integer<span class="o">)</span> <span class="m">1</span>
redis <span class="m">127</span>.0.0.1:6379&gt; PUBLISH redisChat <span class="s2">"Learn redis by tutorials point"</span>
<span class="o">(</span>integer<span class="o">)</span> <span class="m">1</span>
<span class="m">1</span><span class="o">)</span> <span class="s2">"message"</span>
<span class="m">2</span><span class="o">)</span> <span class="s2">"redisChat"</span>
<span class="m">3</span><span class="o">)</span> <span class="s2">"Redis is a great caching technique"</span>
<span class="m">1</span><span class="o">)</span> <span class="s2">"message"</span>
<span class="m">2</span><span class="o">)</span> <span class="s2">"redisChat"</span>
<span class="m">3</span><span class="o">)</span> <span class="s2">"Learn redis by tutorials point"</span>
</pre></div>

<p>
PubSub 的更多操作命令详见 <a href="https://www.tutorialspoint.com/redis/redis_pub_sub.htm">redis PubSub</a> 。<br></p>
</div>
</div>

<div id="outline-container-orgf584eae" class="outline-3">
<h3 id="orgf584eae">
<span class="section-number-3">2.3</span> Transaction 事务</h3>
<div class="outline-text-3" id="text-2-3">
<p>
redis 的 transcation 允许在单步中执行多条命令。transcation 有如下两条特点：<br></p>
<ol class="org-ol">
<li>所有在 transcation 中的命令会作为一条独立的操作有序执行，不能在 transcation 中处理其他客户端的请求；<br>
</li>
<li>transcation 是原子化操作，这意味着，这些命令要么全部执行，要么全部不执行。<br>
</li>
</ol>
<p>
transcation 操作示例<br></p>
<div class="highlight"><pre><span></span>redis <span class="m">127</span>.0.0.1:6379&gt; MULTI
OK
redis <span class="m">127</span>.0.0.1:6379&gt; SET tutorial redis
QUEUED
redis <span class="m">127</span>.0.0.1:6379&gt; GET tutorial
QUEUED
redis <span class="m">127</span>.0.0.1:6379&gt; INCR visitors
QUEUED
redis <span class="m">127</span>.0.0.1:6379&gt; EXEC
<span class="m">1</span><span class="o">)</span> OK
<span class="m">2</span><span class="o">)</span> <span class="s2">"redis"</span>
<span class="m">3</span><span class="o">)</span> <span class="o">(</span>integer<span class="o">)</span> <span class="m">1</span>
</pre></div>

<p>
transaction 的更多操作命令详见 <a href="https://www.tutorialspoint.com/redis/redis_transactions.htm">redis transcation</a> 。<br></p>
</div>
</div>

<div id="outline-container-orgf996b26" class="outline-3">
<h3 id="orgf996b26">
<span class="section-number-3">2.4</span> Scripting 脚本编程</h3>
<div class="outline-text-3" id="text-2-4">
<p>
redis 支持使用 lua 脚本进行编程，redis 从2.6.0版本开始中内置了 lua 脚本解释器。<br></p>

<p>
script 操作示例<br></p>
<div class="highlight"><pre><span></span>redis <span class="m">127</span>.0.0.1:6379&gt; EVAL <span class="s2">"return {KEYS[1],KEYS[2],ARGV[1],ARGV[2]}"</span> <span class="m">2</span> key1 key2 first second
<span class="m">1</span><span class="o">)</span> <span class="s2">"key1"</span>
<span class="m">2</span><span class="o">)</span> <span class="s2">"key2"</span>
<span class="m">3</span><span class="o">)</span> <span class="s2">"first"</span>
<span class="m">4</span><span class="o">)</span> <span class="s2">"second"</span>
</pre></div>

<p>
scripting 的更多操作命令详见 <a href="https://www.tutorialspoint.com/redis/redis_scripting.htm">redis scripting</a> 。<br></p>
</div>
</div>
</div>

<div id="outline-container-orgc4e041f" class="outline-2">
<h2 id="orgc4e041f">
<span class="section-number-2">3</span> 使用辅助命令</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-org882fe68" class="outline-3">
<h3 id="org882fe68">
<span class="section-number-3">3.1</span> connection 相关命令</h3>
<div class="outline-text-3" id="text-3-1">
<p>
connection 命令主要用于管理客户端与服务端的链接。<br></p>

<p>
操作示例：<br></p>
<div class="highlight"><pre><span></span>redis <span class="m">127</span>.0.0.1:6379&gt; AUTH <span class="s2">"password"</span>
OK
redis <span class="m">127</span>.0.0.1:6379&gt; PING
PONG
</pre></div>

<p>
connection 的更多操作命令详见 <a href="https://www.tutorialspoint.com/redis/redis_connection.htm">redis connection</a> 。<br></p>
</div>
</div>

<div id="outline-container-org399b5e8" class="outline-3">
<h3 id="org399b5e8">
<span class="section-number-3">3.2</span> server 相关命令</h3>
<div class="outline-text-3" id="text-3-2">
<p>
server 命令主要用于对服务端进行管理。<br></p>

<p>
使用 INFO 命令查看服务端配置。<br></p>
<div class="highlight"><pre><span></span>redis <span class="m">127</span>.0.0.1:6379&gt; INFO

<span class="c1"># Server</span>
redis_version:2.8.13
redis_git_sha1:00000000
redis_git_dirty:0
redis_build_id:c2238b38b1edb0e2
redis_mode:standalone
os:Linux <span class="m">3</span>.5.0-48-generic x86_64
...
</pre></div>

<p>
server 的更多操作命令详见 <a href="https://www.tutorialspoint.com/redis/redis_server.htm">redis server</a> 。<br></p>
</div>
</div>
</div>

<div id="outline-container-orga286263" class="outline-2">
<h2 id="orga286263">
<span class="section-number-2">4</span> 高级用法</h2>
<div class="outline-text-2" id="text-4">
</div>
<div id="outline-container-orge5b8074" class="outline-3">
<h3 id="orge5b8074">
<span class="section-number-3">4.1</span> 备份数据库</h3>
<div class="outline-text-3" id="text-4-1">
<p>
使用 SAVE 命令创建当前数据库数据的备份。操作示例如下：<br></p>
<div class="highlight"><pre><span></span><span class="m">127</span>.0.0.1:6379&gt; SAVE
OK
</pre></div>
<p>
以上命令会在 redis 目录中生成 dump.rdb 文件。<br>
我在练习时使用了 docker 版的 redis，将 container 中的文件拷贝到 host 的操作为：<br></p>
<div class="highlight"><pre><span></span>docker cp &lt;container name&gt;:/path/inside /path/outside
</pre></div>

<p>
在恢复数据时，将 dump.rdb 放在 redis 目录后再启动 redis 服务即可。使用 CONFIG 命令获取 redis 目录路径。<br></p>
<div class="highlight"><pre><span></span><span class="m">127</span>.0.0.1:6379&gt; CONFIG get dir
<span class="m">1</span><span class="o">)</span> <span class="s2">"dir"</span>
<span class="m">2</span><span class="o">)</span> <span class="s2">"/user/tutorialspoint/redis-2.8.13/src"</span>
</pre></div>
</div>
</div>

<div id="outline-container-org5524cff" class="outline-3">
<h3 id="org5524cff">
<span class="section-number-3">4.2</span> 设置连接密码</h3>
<div class="outline-text-3" id="text-4-2">
<p>
为 redis 设置密码，在客户端链接后需要输入密码才能操作数据库。<br>
查看当前密码<br></p>
<div class="highlight"><pre><span></span><span class="m">127</span>.0.0.1:6379&gt; CONFIG get requirepass
<span class="m">1</span><span class="o">)</span> <span class="s2">"requirepass"</span>
<span class="m">2</span><span class="o">)</span> <span class="s2">""</span>
</pre></div>
<p>
默认情况下，密码是空的，在客户端连接后也就不需要做验证。<br></p>

<p>
设置密码<br></p>
<div class="highlight"><pre><span></span><span class="m">127</span>.0.0.1:6379&gt; CONFIG <span class="nb">set</span> requirepass <span class="s2">"tutorialspoint"</span>
OK
</pre></div>

<p>
密码设置是即时生效的，当前链接的客户端都会要求输入密码验证后才可以进行后续操作。验证密码的操作示例。<br></p>
<div class="highlight"><pre><span></span><span class="m">127</span>.0.0.1:6379&gt; AUTH password
</pre></div>
</div>
</div>

<div id="outline-container-org156dd14" class="outline-3">
<h3 id="org156dd14">
<span class="section-number-3">4.3</span> 性能测试</h3>
<div class="outline-text-3" id="text-4-3">
<p>
redis 提供了 redis-benchmark 工具对性能进行测试。<br></p>

<p>
操作示例<br></p>
<div class="highlight"><pre><span></span>redis-benchmark -n <span class="m">100000</span>

PING_INLINE: <span class="m">141043</span>.72 requests per second
PING_BULK: <span class="m">142857</span>.14 requests per second
SET: <span class="m">141442</span>.72 requests per second
GET: <span class="m">145348</span>.83 requests per second
INCR: <span class="m">137362</span>.64 requests per second
LPUSH: <span class="m">145348</span>.83 requests per second
LPOP: <span class="m">146198</span>.83 requests per second
SADD: <span class="m">146198</span>.83 requests per second
SPOP: <span class="m">149253</span>.73 requests per second
LPUSH <span class="o">(</span>needed to benchmark LRANGE<span class="o">)</span>: <span class="m">148588</span>.42 requests per second
LRANGE_100 <span class="o">(</span>first <span class="m">100</span> elements<span class="o">)</span>: <span class="m">58411</span>.21 requests per second
LRANGE_300 <span class="o">(</span>first <span class="m">300</span> elements<span class="o">)</span>: <span class="m">21195</span>.42 requests per second
LRANGE_500 <span class="o">(</span>first <span class="m">450</span> elements<span class="o">)</span>: <span class="m">14539</span>.11 requests per second
LRANGE_600 <span class="o">(</span>first <span class="m">600</span> elements<span class="o">)</span>: <span class="m">10504</span>.20 requests per second
MSET <span class="o">(</span><span class="m">10</span> keys<span class="o">)</span>: <span class="m">93283</span>.58 requests per second
</pre></div>

<p>
更详细的操作说明可以参考 <a href="https://www.tutorialspoint.com/redis/redis_benchmarks.htm">redis benchmark</a> 。<br></p>
</div>
</div>

<div id="outline-container-org258fad3" class="outline-3">
<h3 id="org258fad3">
<span class="section-number-3">4.4</span> 客户端链接</h3>
<div class="outline-text-3" id="text-4-4">
<p>
客户端在连入后会发生如下操作：<br></p>
<ul class="org-ul">
<li>客户端的 socket 被设置为非阻塞模式（non-blocking），由于 redis 使用了多路服用技术和非阻塞 I/O；<br>
</li>
<li>将 socket 设置为 <code>TCP_NODELAY</code> ，以确保在链接中没有延迟；<br>
</li>
<li>创建一个可读文件事件，这样 redis 就能在客户端有查询时读取 socket 中的数据。<br>
</li>
</ul>
<p>
读取允许客户端的最大数目，操作示例如下：<br></p>
<div class="highlight"><pre><span></span>config get maxclients
<span class="m">1</span><span class="o">)</span> <span class="s2">"maxclients"</span>
<span class="m">2</span><span class="o">)</span> <span class="s2">"10000"</span>
</pre></div>

<p>
对于客户端的更多操作可以参考 <a href="https://www.tutorialspoint.com/redis/redis_client_connection.htm">redis client</a> 。<br></p>
</div>
</div>
